wmy2370cn/nxp-lpc/NXP-LPC/V7/Bsp/LPC2378/nic_bsp.c
#define  MAIN_OSC_FRQ              12000000L
#define  IRC_OSC_FRQ               12000000L
#define  RTC_OSC_FRQ                  32768L


INT32U  bsp_cpu_clk_freq (void)
{
	INT32U  msel;
	INT32U  nsel;
	INT32U  fin;
	INT32U  pll_clk_feq;                                    /* When the PLL is enabled, this is Fcco                    */
	INT32U  clk_div;
	INT32U  clk_freq;

	switch (CLKSRCSEL & 0x03)
	{                                 /* Determine the current clock source                       */
		case 0:
			fin        =  IRC_OSC_FRQ;
			break;
		case 1:
			fin        =  MAIN_OSC_FRQ;
			break;
		case 2:
			fin        =  RTC_OSC_FRQ;
			break;
		default:
			fin        =  IRC_OSC_FRQ;
			break;
	}

	if ((PLLSTAT & (1 << 25)) > 0) 
	{                                                              /* If the PLL is currently enabled and connected        */
		msel        = (INT32U)(PLLSTAT & 0x3FFF) + 1;           /* Obtain the PLL multiplier                            */
		nsel        = (INT32U)((PLLSTAT >>   16) & 0x0F) + 1;   /* Obtain the PLL divider                               */
		pll_clk_feq = (2 * msel * fin / nsel);                      /* Compute the PLL output frequency                     */
	} 
	else
	{
		pll_clk_feq = (fin);                                        /* The PLL is bypassed                                  */
	}

	clk_div         = (INT8U)(CCLKCFG & 0x0F) + 1;             /* Obtain the CPU core clock divider                    */
	clk_freq        = (INT32U)(pll_clk_feq / clk_div);          /* Compute the ARM Core clock frequency                 */

	return (clk_freq);
}
 
void rt_delayms(INT32U ms)
{
	//执行11059200次语句，花时3.570S，差不多每ms计算3097条语句
	INT32U count=3339*ms;
	INT32U i;
	for (i=0;i<count;i++)
	{
		__asm{ NOP };
	}
}


void  nic_int_init  (void)
{
 //	rt_hw_interrupt_install(VIC_ETHERNET, nic_isr_handler, RT_NULL);
 //	rt_hw_interrupt_umask(VIC_ETHERNET);

	VICIntSelect       &= ~(1 << VIC_ETHERNET);                         /* Configure the Ethernet VIC interrupt source for IRQ      */
	VICVectAddr21       =  (CPU_INT32U)nic_isr_handler;              /* Set the vector address                                   */
	VICIntEnable        =  (1 << VIC_ETHERNET);                         /* Enable the VIC interrupt source, but no local sources    */
}


/* See the header file for descriptions of public functions. */
/*********************************************************************************************************
** 函数名称: lpc24xxether_write_frame
** 函数名称: lpc24xxether_write_frame
**
** 功能描述：  
**
** 输　入:  INT8U * ptr
** 输　入:  INT32U length
** 输　入:  rt_bool_t eof
**          
** 输　出:   void
**         
** 全局变量:  
** 调用模块: 无
**
** 作　者:  LiJin
** 日　期:  2009年8月17日
** 备  注:  
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 备  注: 
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
void lpc24xxether_write_frame(INT8U *ptr, INT32U length, INT8U eof)
{
	INT8U *buf_ptr;
	INT32U current_tb_index = 0;
	INT32U is_last, tx_offset = 0, remain, pdu_length;

	INT32U TxProduceIndex = MAC_TXPRODUCEINDEX;
	INT32U TxConsumeIndex = MAC_TXCONSUMEINDEX;	 
	//需要增加一些参数检测
	if (ptr == NULL || length == 0||length >= 65535)
	{
		SetLed(2,TRUE);
		return;
	}

	while(tx_offset < length)
	{
		/* check whether buffer is available */
 		if (TxConsumeIndex == (TxProduceIndex+1)%NUM_TX_FRAG)
 			return;	
// 		while( TxConsumeIndex == (TxProduceIndex+1)%NUM_TX_FRAG)
// 		{	/* no buffer */
// 	 		OSTimeDly(5);
// 			TxProduceIndex = MAC_TXPRODUCEINDEX;
// 			TxConsumeIndex = MAC_TXCONSUMEINDEX;
// 		}

		/* Get the address of the buffer from the descriptor, then copy	the data into the buffer. */
		current_tb_index = MAC_TXPRODUCEINDEX;
		buf_ptr = (INT8U *)tb_descriptors[current_tb_index].Packet;

		/* How much can we write to the buffer? */
		remain = length - tx_offset;
		pdu_length = (remain <= ETH_FRAG_SIZE)? remain : ETH_FRAG_SIZE;

		/* Copy the data into the buffer. */
		memcpy(buf_ptr, &ptr[tx_offset], pdu_length );
		tx_offset += pdu_length;

		/* Is this the last data for the frame? */
		if((eof == OS_TRUE) )
			is_last = OS_TRUE;
		else 
			is_last = OS_FALSE;

		/* Fill out the necessary in the descriptor to get the data sent,then move to the next descriptor, wrapping if necessary. */
		if(is_last)
		tb_descriptors[current_tb_index].Ctrl =  (EMAC_TX_DESC_OVERRIDE   |        /* Override the defaults from the MAC internal registers    */
			EMAC_TX_DESC_PAD        |        /* Add padding for frames < 64 bytes                        */
			EMAC_TX_DESC_LAST       |        /* No additional descriptors to follow, this is the last    */
			EMAC_TX_DESC_CRC)       |        /* Append the CRC automatically                             */
			(pdu_length - 1);                       /* Write the size of the frame, starting from 0             */
		else
			tb_descriptors[current_tb_index].Ctrl =  (EMAC_TX_DESC_OVERRIDE   |        /* Override the defaults from the MAC internal registers    */
			EMAC_TX_DESC_PAD        |        /* Add padding for frames < 64 bytes                        */
			EMAC_TX_DESC_CRC)       |        /* Append the CRC automatically                             */
			(pdu_length - 1);               /* Write the size of the frame, starting from 0             */

		MAC_TXPRODUCEINDEX      =   (current_tb_index + 1) % NUM_TX_FRAG;    /* Increment the produce Ix register, initiate Tx of frame  */
	}
}
/* ethernet device interface */
INT8U IsTxDescFull( )
{
	INT32U TxProduceIndex = MAC_TXPRODUCEINDEX;
	INT32U TxConsumeIndex = MAC_TXCONSUMEINDEX;	 
	
	if (TxConsumeIndex == (TxProduceIndex+1)%NUM_TX_FRAG)
	{	
		return TRUE;	
	}
	return FALSE;
}
INT8U IsTxDescEmpty( )
{
	INT32U TxProduceIndex = MAC_TXPRODUCEINDEX;
	INT32U TxConsumeIndex = MAC_TXCONSUMEINDEX;	 

	if (TxConsumeIndex == TxProduceIndex)
	{
		return OS_TRUE;
	}

	return OS_FALSE;
}
INT16U lpc24xxether_write_frame_ex(INT8U *pSrc ,INT16U nSrcLen, INT32U *pProduceIdx, INT16U *pDescOffset,INT8U eof)
{
	//	INT16U nTxCnt = 0;
	INT8U *pDescBuf = NULL;
	INT16U nTxOffset = 0,nRemainSrc = 0, nRemainDesc = 0, pdu_length;

	if (pSrc == NULL || pProduceIdx == NULL || pDescOffset == NULL)
	{
		return 0;
	}

	if (nSrcLen > 5000 || nSrcLen == 0)
	{
		return 0;
	}

	if (*pDescOffset >= ETH_FRAG_SIZE || *pProduceIdx >= NUM_TX_FRAG)
	{
		return 0;	
	}

	pDescBuf = (INT8U *)tb_descriptors[*pProduceIdx].Packet;

	while (nTxOffset < nSrcLen)
	{
		nRemainDesc = ETH_FRAG_SIZE - *pDescOffset; //描述符的空间
		nRemainSrc = nSrcLen - nTxOffset; //还没有发送的长度
		pdu_length = (nRemainSrc <= nRemainDesc)? nRemainSrc : nRemainDesc;

		pDescBuf += *pDescOffset;

