wmy2370cn/nxp-lpc/NXP-LPC/V7/Bsp/LPC2378/nic_bsp.c
		memcpy(pDescBuf, &pSrc[nTxOffset], pdu_length );

		//更新
		nTxOffset += pdu_length;
		*pDescOffset += pdu_length;
		//写入状态字
		if(nTxOffset >= nSrcLen && eof)
		{
			tb_descriptors[*pProduceIdx].Ctrl =  (EMAC_TX_DESC_OVERRIDE   |        /* Override the defaults from the MAC internal registers    */
				EMAC_TX_DESC_PAD        |        /* Add padding for frames < 64 bytes                        */
				EMAC_TX_DESC_LAST       |        /* No additional descriptors to follow, this is the last    */
				EMAC_TX_DESC_CRC)       |        /* Append the CRC automatically                             */
				(*pDescOffset - 1);                /* Write the size of the frame, starting from 0             */
		}
		else
		{
			tb_descriptors[*pProduceIdx].Ctrl =  (EMAC_TX_DESC_OVERRIDE   |        /* Override the defaults from the MAC internal registers    */
				EMAC_TX_DESC_PAD        |        /* Add padding for frames < 64 bytes                        */
				EMAC_TX_DESC_CRC)       |        /* Append the CRC automatically                             */
				(*pDescOffset - 1);                /* Write the size of the frame, starting from 0             */
		}

		if (*pDescOffset >= ETH_FRAG_SIZE || eof)
		{
			(*pProduceIdx) ++;
			if (*pProduceIdx >= NUM_TX_FRAG)
			{
				*pProduceIdx -= NUM_TX_FRAG;
			}
		}			 
	}

	return nTxOffset;
}

 
#define   MIN(x, y)   ((x)   >   (y)   ?   (y)   :   (x)) 
INT16U lpc24xxether_write_frame_ex2( struct pbuf* p )
{
	struct pbuf* q;
	INT8U *pDescBuf = NULL;
	INT8U *pSrcBuf = NULL;
	INT16U nTxBufOffset = 0,nDescOffset = 0,nPduLen = 0,nSendLen = 0;

	INT32U TxProduceIndex = MAC_TXPRODUCEINDEX;
	INT32U TxConsumeIndex = MAC_TXCONSUMEINDEX;	 

	if (p == NULL)
		return 0;
	if (p->tot_len > 1000)
	{
		SetLed(8,1);
	}
	pDescBuf = (INT8U *)tb_descriptors[TxProduceIndex].Packet;

	for (q = p; q != NULL; q = q->next)
	{
		nTxBufOffset = 0;
		if (q && q->len)
		{
			pSrcBuf = (INT8U*) q->payload;

			while( nTxBufOffset < q->len )
			{
				nPduLen = MIN(ETH_FRAG_SIZE-nDescOffset,q->len-nTxBufOffset);
				if (nPduLen)
				{
					memcpy(&pDescBuf[nDescOffset], &pSrcBuf[nTxBufOffset], nPduLen );
					nSendLen += nPduLen;

					if (nSendLen >= p->tot_len)
					{
						tb_descriptors[TxProduceIndex].Ctrl =  (EMAC_TX_DESC_OVERRIDE   |        /* Override the defaults from the MAC internal registers    */
							EMAC_TX_DESC_PAD        |        /* Add padding for frames < 64 bytes                        */
							EMAC_TX_DESC_LAST       |        /* No additional descriptors to follow, this is the last    */
							EMAC_TX_DESC_CRC)       |        /* Append the CRC automatically                             */
							(nPduLen + nDescOffset- 1);                       /* Write the size of the frame, starting from 0             */
					}
					else
					{
						tb_descriptors[TxProduceIndex].Ctrl =  (EMAC_TX_DESC_OVERRIDE   |        /* Override the defaults from the MAC internal registers    */
							EMAC_TX_DESC_PAD        |        /* Add padding for frames < 64 bytes                        */
							EMAC_TX_DESC_CRC)       |        /* Append the CRC automatically                             */
							(nPduLen + nDescOffset- 1);                       /* Write the size of the frame, starting from 0             */
					}

					nTxBufOffset += nPduLen;
					nDescOffset += nPduLen;
				
					//更新
					if (nDescOffset >= ETH_FRAG_SIZE )
					{
						TxProduceIndex ++;
						if (TxProduceIndex >= NUM_TX_FRAG)
						{
							TxProduceIndex -= NUM_TX_FRAG;
						}
						pDescBuf = (INT8U *)tb_descriptors[TxProduceIndex].Packet;
					}
					else if (nSendLen >= p->tot_len)
					{
						TxProduceIndex ++;
						if (TxProduceIndex >= NUM_TX_FRAG)
						{
							TxProduceIndex -= NUM_TX_FRAG;
						}
						break;
					}
				}
			}
		}							   
	}
	MAC_TXPRODUCEINDEX = TxProduceIndex;
}
/*
* Transmit packet.
*/
static INT16U tx_led_no = 5;
extern INT8U SendLedMsg( INT16U *pMsg );
INT8U lpc24xxether_tx( eth_device_t dev, struct pbuf* p)
{
	struct pbuf* q;
	INT8U err = OS_NO_ERR;

	SendLedMsg(&tx_led_no);
	if (p->tot_len > 1000)
	{
		SetLed(6,TRUE);
	}

// 	err = IsTxDescEmpty();
// 	if (err == FALSE)
// 	{
// 		return 0;
// 	}
// 	while(!IsTxDescEmpty())
// 	{
// 		OSTimeDly(5);
// 	}

	/* lock tx operation */
//	rt_sem_take(&tx_sem, RT_WAITING_FOREVER);
	OSSemPend(tx_sem,0,&err);
	lpc24xxether_write_frame_ex2(p);
	OSSemPost(tx_sem);
#if 0
	OSSemPend(tx_sem,0,&err);
 
	for (q = p; q != NULL; q = q->next)
	{
		if (q->next == RT_NULL)
			lpc24xxether_write_frame(q->payload, q->len, OS_TRUE);
		else
			lpc24xxether_write_frame(q->payload, q->len, OS_FALSE);
	}

	OSSemPost(tx_sem);
//	rt_sem_release(&tx_sem);
#endif

	return 0;
}
/*
*********************************************************************************************************
*                                         NIC_RxGetNRdy()
*
* Description : Determines how many packets we are ready to be processed.
*
* Parameters  : None.
*
* Returns     : Number of NIC buffers that are ready to be processed by the stack.
*********************************************************************************************************
*/ 
static  INT16U  get_rx_pkt_cnt (void)
{
	INT16U     n_rdy;
	INT16U     rxconsumeix;
	INT16U     rxproduceix;

	rxconsumeix =   MAC_RXCONSUMEINDEX;
	rxproduceix =   MAC_RXPRODUCEINDEX;

	if (rxproduceix < rxconsumeix) 
	{ /* If the produce index has wrapped around                  */
		n_rdy   =   NUM_RX_FRAG - rxconsumeix + rxproduceix;
	}
	else
	{ /* If consumeix is < produceix, then no wrap around occured */
		n_rdy   =   rxproduceix - rxconsumeix;
	}

	return (n_rdy);
}

INT16U get_nic_rx_frame_size (void)
{
	INT16U     rxconsumeix;
	INT16U     rxproduceix;
	INT16U     desc_cnt=0 , i =0;
	INT16U     rx_frame_size = 0;
	INT32U   rxstatus;
	INT8U   flag = OS_FALSE;

	rxconsumeix =   MAC_RXCONSUMEINDEX;
	rxproduceix =   MAC_RXPRODUCEINDEX;
	if (rxconsumeix == rxproduceix )
	{
		return rx_frame_size;
	}

